RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_pdm_pcm_v2.h
/** \} group_pdm_pcm_macros_interrupt_masks_v2 */

/** \} group_pdm_pcm_macros_v2 */

/**
* \addtogroup group_pdm_pcm_enums_v2
* \{
*/

/** PDM Word Length*/
typedef enum
{
    CY_PDM_PCM_WSIZE_8_BIT      = 0U,         /**< Word length: 8 bit*/
    CY_PDM_PCM_WSIZE_10_BIT     = 1U,         /**< Word length: 10 bit*/
    CY_PDM_PCM_WSIZE_12_BIT     = 2U,         /**< Word length: 12 bit*/
    CY_PDM_PCM_WSIZE_14_BIT     = 3U,         /**< Word length: 14 bit*/
    CY_PDM_PCM_WSIZE_16_BIT     = 4U,         /**< Word length: 16 bit*/
    CY_PDM_PCM_WSIZE_18_BIT     = 5U,         /**< Word length: 18 bit*/
    CY_PDM_PCM_WSIZE_20_BIT     = 6U,         /**< Word length: 20 bit*/
    CY_PDM_PCM_WSIZE_24_BIT     = 7U,         /**< Word length: 24 bit*/
    CY_PDM_PCM_WSIZE_32_BIT     = 8U          /**< Word length: 32 bit*/
} cy_en_pdm_pcm_word_size_t;

/** cy_en_pdm_pcm_clock_sel_t*/
typedef enum
{
    CY_PDM_PCM_SEL_SRSS_CLOCK   = 0U,         /**< Interface clock is selected as clk_if_srss[0]*/
    CY_PDM_PCM_SEL_PDM_DATA0    = 1U,         /**< Interface clock is selected as pdm_data[0]*/
    CY_PDM_PCM_SEL_PDM_DATA1    = 2U,         /**< Interface clock is selected as pdm_data[1]*/
    CY_PDM_PCM_SEL_OFF          = 3U          /**< Interface clock clk_if is off*/
} cy_en_pdm_pcm_clock_sel_t;

/** PDM Halve Rate Sampling*/
typedef enum
{
    CY_PDM_PCM_RATE_FULL       = 0U,         /**< Channel full*/
    CY_PDM_PCM_RATE_HALVE      = 1U          /**< Channel halve*/
} cy_en_pdm_pcm_halve_rate_sel_t;

/** CIC DECIMATION CODE*/
typedef enum
{
    CY_PDM_PCM_CHAN_CIC_DECIM_2   = 0U,         /**< CIC Filter PCM Frequency is 1/2 * PDM Frequency*/
    CY_PDM_PCM_CHAN_CIC_DECIM_4   = 1U,         /**< CIC Filter PCM Frequency is 1/4 * PDM Frequency*/
    CY_PDM_PCM_CHAN_CIC_DECIM_8   = 2U,         /**< CIC Filter PCM Frequency is 1/8 * PDM Frequency*/
    CY_PDM_PCM_CHAN_CIC_DECIM_16  = 3U,         /**< CIC Filter PCM Frequency is 1/16 * PDM Frequency*/
    CY_PDM_PCM_CHAN_CIC_DECIM_32  = 4U          /**< CIC Filter PCM Frequency is 1/32 * PDM Frequency*/
} cy_en_pdm_pcm_ch_cic_decimcode_t;

/** FIR0 DECIMATION CODE*/
typedef enum
{
    CY_PDM_PCM_CHAN_FIR0_DECIM_1  = 0U,         /**< FIR0 Filter PCM Frequency is 1/1 * PCM Frequency*/
    CY_PDM_PCM_CHAN_FIR0_DECIM_2  = 1U,         /**< FIR0 Filter PCM Frequency is 1/2 * PCM Frequency*/
    CY_PDM_PCM_CHAN_FIR0_DECIM_3  = 2U,         /**< FIR0 Filter PCM Frequency is 1/3 * PCM Frequency*/
    CY_PDM_PCM_CHAN_FIR0_DECIM_4  = 3U,         /**< FIR0 Filter PCM Frequency is 1/4 * PCM Frequency*/
    CY_PDM_PCM_CHAN_FIR0_DECIM_5  = 4U          /**< FIR0 Filter PCM Frequency is 1/5 * PCM Frequency*/
} cy_en_pdm_pcm_ch_fir0_decimcode_t;

/** FIR1 DECIMATION CODE*/
typedef enum
{
    CY_PDM_PCM_CHAN_FIR1_DECIM_1   = 0U,         /**< FIR1 Filter PCM Frequency is 1/1 * PCM Frequency*/
    CY_PDM_PCM_CHAN_FIR1_DECIM_2   = 1U,         /**< FIR1 Filter PCM Frequency is 1/2 * PCM Frequency*/
    CY_PDM_PCM_CHAN_FIR1_DECIM_3   = 2U,         /**< FIR1 Filter PCM Frequency is 1/3 * PCM Frequency*/
    CY_PDM_PCM_CHAN_FIR1_DECIM_4   = 3U,         /**< FIR1 Filter PCM Frequency is 1/4 * PCM Frequency*/
} cy_en_pdm_pcm_ch_fir1_decimcode_t;

/** DC Block CODE*/
typedef enum
{
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_1   = 0U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-0))*/
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_2   = 1U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-1))*/
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_4   = 2U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-2))*/
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_8   = 3U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-3))*/
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_16  = 4U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-4))*/
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_32  = 5U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-5))*/
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_64  = 6U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-6))*/
    CY_PDM_PCM_CHAN_DCBLOCK_CODE_128 = 7U,         /**< DCBLOCK Filter alpha = 1 - (1/2^(12-7))*/
} cy_en_pdm_pcm_ch_dcblock_coef_t;

/** \cond INTERNAL */
/** PDM Output Mode*/
typedef enum
{
    CY_PDM_PCM_OUT_CHAN_LEFT   = 1U,         /**< Channel mono left*/
    CY_PDM_PCM_OUT_CHAN_RIGHT  = 2U,         /**< Channel mono right*/
    CY_PDM_PCM_OUT_STEREO      = 3U          /**< Channel stereo*/
} cy_en_pdm_pcm_out_t;
/** \endcond */

/** The PDM-PCM status codes*/
typedef enum
{
    CY_PDM_PCM_SUCCESS         = 0x00UL,    /**< Success status code*/
    CY_PDM_PCM_BAD_PARAM       = CY_PDM_PCM_V2_ID | CY_PDL_STATUS_ERROR |0x01UL     /**< Bad parameter status code*/
} cy_en_pdm_pcm_status_t;

/** \} group_pdm_pcm_enums_v2 */


/**
* \addtogroup group_pdm_pcm_data_structures_v2
* \{
*/

/******************************************************************************
 * Global type definitions
 ******************************************************************************/

 /** PDM-PCM Test Mode configuration */
 typedef struct
 {
     uint8_t drive_delay_hi;                /**< Interface drive delay on the high phase of the PDM interface clock.
                                             This field specifies when a PDM value is driven expressed in clk_if clock cycles.
                                             DRIVE_DELAY should be set in the range [0, IF_CTL.CLOCK_DIV]:
                                            "0": Drive PDM value 1 clk_if cycle after the rising edge of clk_pdm.
                                            "1": Drive PDM value 2 clk_if cycles after the rising edge of clk_pdm.
                                            ...
                                            "255": Drive PDM value 256 clk_if cycles after the rising edge of clk_pdm*/
     uint8_t drive_delay_lo;                /**< Interface drive delay on the low phase of the PDM interface clock.
                                             This field specifies when a PDM value is driven expressed in clk_if clock cycles.
                                             DRIVE_DELAY should be set in the range [0, IF_CTL.CLOCK_DIV]:
                                            "0": Drive PDM value 1 clk_if cycle after the rising edge of clk_pdm.
                                            "1": Drive PDM value 2 clk_if cycles after the rising edge of clk_pdm.
                                            ...
                                            "255": Drive PDM value 256 clk_if cycles after the rising edge of clk_pdm*/
     uint8_t mode_hi;                        /**< Pattern generator mode on the high phase of the PDM interface clock.
                                            This field specifies the type of pattern driven by the generator:
                                            "0": constant 0's
                                            "1": constant 1's
                                            "2": alternating 0's and 1's (clock pattern)
                                            "3": sine wave */
     uint8_t mode_lo;                        /**< Pattern generator mode on the low phase of the PDM interface clock.
                                            This field specifies the type of pattern driven by the generator:
                                            "0": constant 0's
                                            "1": constant 1's
                                            "2": alternating 0's and 1's (clock pattern)
                                            "3": sine wave */
     uint8_t audio_freq_div;                /**< Frequency division factor (legal range [3, 13]) to obtain audio frequency
                                            from the PDM clock frequency. This field determines the frequency of the sine wave
                                            generated by the pattern generator when MODE=3. The formula is below:
                                            Sine wave Frequency = PDM clock frequency / 2p*2^(AUDIO_FREQ_DIV) */
     bool    enable;            /**<  enable*/


