RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_pdm_pcm_v2.h
/** \} group_pdm_pcm_data_structures_v2 */


/** \cond INTERNAL */
/******************************************************************************
 * Local definitions
*******************************************************************************/
/** Define bit mask for all available interrupt sources */
#define CY_PDM_PCM_INTR_MASK        (CY_PDM_PCM_INTR_RX_TRIGGER           | \
                                     CY_PDM_PCM_INTR_RX_FIR_OVERFLOW     | \
                                     CY_PDM_PCM_INTR_RX_OVERFLOW          | \
                                     CY_PDM_PCM_INTR_RX_IF_OVERFLOW      | \
                                     CY_PDM_PCM_INTR_RX_UNDERFLOW)

/* Non-zero default values */
#define CY_PDM_PCM_CH_IF_CTL_DEFAULT    (0x3U)

#define CY_PDM_PCM_CLK_DIV_MAX 255

#define CY_PDM_PCM_CH_CIC_DECIM_CODE_DEFAULT    (0x4U)
#define CY_PDM_PCM_CH_FIR0_DECIM_CODE_DEFAULT   (0x0U)
#define CY_PDM_PCM_CH_FIR0_SCALE_DEFAULT           (0x0U)
#define CY_PDM_PCM_CH_FIR1_DECIM_CODE_DEFAULT   (0x1U)
#define CY_PDM_PCM_CH_FIR1_SCALE_DEFAULT           (0x0FU)
#define CY_PDM_PCM_CH_FIR1_ENABLE_DEFAULT       (0x1U)
#define CY_PDM_PCM_CH_DCBLOCK_CODE_DEFAULT       (0x1U)
#define CY_PDM_PCM_CH_DCBLOCK_ENABLE_DEFAULT       (0x1U)

#define PDM_TEST_CTL_DRIVE_DELAY_HI_DEFAULT       (0x00U)
#define PDM_TEST_CTL_DRIVE_DELAY_LO_DEFAULT       (0x04U)
#define PDM_TEST_CTL_MODE_HI_DEFAULT               (0x3U)
#define PDM_TEST_CTL_MODE_LO_DEFAULT               (0x3U)
#define PDM_TEST_CTL_AUDIO_FREQ_DIV_DEFAULT       (0x7U)
#define PDM_TEST_CTL_CH_ENABLED_DEFAULT           (0x0U)

#define PDM_CLOCK_CTL_CLOCK_DIV_DEFAULT           (0x07U)
#define PDM_CLOCK_CTL_CLOCK_SEL_DEFAULT           (0x3U)
#define PDM_CLOCK_CTL_HALVE_DEFAULT               (0x0U)


#define CY_PDM_PCM_ENABLE  (0x1U)
#define CY_PDM_PCM_DISABLE (0x0U)



#define CY_PDM_PCM_CH_CTL_WORDSIZE_DEFAULT        (0x0U)
#define CY_PDM_PCM_CH_CTL_WORDSIGN_EXT_DEFAULT  (0x100U)
#define CY_PDM_PCM_CH_CTL_CH_ENABLE_DEFAULT        (0x00000000U)

#define CY_PDM_PCM_TEST_CTL_DEFAULT (_VAL2FLD(PDM_TEST_CTL_DRIVE_DELAY_HI, PDM_TEST_CTL_DRIVE_DELAY_HI_DEFAULT) | \
                                _VAL2FLD(PDM_TEST_CTL_DRIVE_DELAY_LO, PDM_TEST_CTL_DRIVE_DELAY_LO_DEFAULT) | \
                                _VAL2FLD(PDM_TEST_CTL_MODE_HI, PDM_TEST_CTL_MODE_HI_DEFAULT) | \
                                _VAL2FLD(PDM_TEST_CTL_MODE_LO, PDM_TEST_CTL_MODE_LO_DEFAULT) | \
                                _VAL2FLD(PDM_TEST_CTL_AUDIO_FREQ_DIV, PDM_TEST_CTL_AUDIO_FREQ_DIV_DEFAULT) | \
                                _VAL2FLD(PDM_TEST_CTL_CH_ENABLED, PDM_TEST_CTL_CH_ENABLED_DEFAULT))

#define CY_PDM_PCM_CLK_CTL_DEFAULT (_VAL2FLD(PDM_CLOCK_CTL_CLOCK_DIV, PDM_CLOCK_CTL_CLOCK_DIV_DEFAULT) | \
                                _VAL2FLD(PDM_CLOCK_CTL_CLOCK_SEL, PDM_CLOCK_CTL_CLOCK_SEL_DEFAULT) | \
                                _VAL2FLD(PDM_CLOCK_CTL_HALVE, PDM_CLOCK_CTL_HALVE_DEFAULT))

#define CY_PDM_PCM_CH_CTL_DEFAULT (_VAL2FLD(PDM_CH_CTL_WORD_SIZE, CY_PDM_PCM_CH_CTL_WORDSIZE_DEFAULT) | \
                                _VAL2FLD(PDM_CH_CTL_WORD_SIGN_EXTEND, CY_PDM_PCM_CH_CTL_WORDSIGN_EXT_DEFAULT) | \
                                _VAL2FLD(PDM_CH_CTL_ENABLED, CY_PDM_PCM_CH_CTL_CH_ENABLE_DEFAULT))

#define CY_PDM_PCM_CH_FIR1_DEFAULT (_VAL2FLD(PDM_CH_FIR1_CTL_DECIM2, CY_PDM_PCM_CH_FIR1_DECIM_CODE_DEFAULT) | \
                                _VAL2FLD(PDM_CH_FIR1_CTL_SCALE, CY_PDM_PCM_CH_FIR1_SCALE_DEFAULT) | \
                                _VAL2FLD(PDM_CH_FIR1_CTL_ENABLED, CY_PDM_PCM_CH_FIR1_ENABLE_DEFAULT))

#define CY_PDM_PCM_CH_DCBLOCK_DEFAULT (_VAL2FLD(PDM_CH_DC_BLOCK_CTL_CODE, CY_PDM_PCM_CH_DCBLOCK_CODE_DEFAULT) | \
                                _VAL2FLD(PDM_CH_DC_BLOCK_CTL_ENABLED, CY_PDM_PCM_CH_DCBLOCK_ENABLE_DEFAULT))



/* Macros for conditions used by CY_ASSERT calls */

#define CY_PDM_PCM_IS_CLK_DIV_VALID(clkDiv)    (((clkDiv)  >= 1U) && ((clkDiv) <= CY_PDM_PCM_CLK_DIV_MAX))

#define CY_PDM_PCM_IS_CLK_SEL_VALID(clksel)    (((clksel) == CY_PDM_PCM_SEL_SRSS_CLOCK)   || \
                                                ((clksel) == CY_PDM_PCM_SEL_PDM_DATA0)       || \
                                                ((clksel) == CY_PDM_PCM_SEL_PDM_DATA1)    || \
                                                ((clksel) == CY_PDM_PCM_SEL_OFF))

#define CY_PDM_PCM_IS_HALVE_RATE_SET_VALID(halverate) (((halverate) == CY_PDM_PCM_RATE_FULL)  || \
                                                       ((halverate) == CY_PDM_PCM_RATE_HALVE))

#define CY_PDM_PCM_IS_ROUTE_VALID(route)        ((route) <= 126)

#define CY_PDM_PCM_IS_CH_SET_VALID(chanselect)    (((chanselect) >= 1U) && ((chanselect) <= 255))

#define CY_PDM_PCM_IS_SAMPLE_DELAY_VALID(sampledelay)    ((sampledelay) <= 255)

#define CY_PDM_PCM_IS_WORD_SIZE_VALID(wordSize) (((wordSize) == CY_PDM_PCM_WSIZE_8_BIT) || \
                                                ((wordSize) == CY_PDM_PCM_WSIZE_10_BIT) || \
                                                ((wordSize) == CY_PDM_PCM_WSIZE_12_BIT) || \
                                                ((wordSize) == CY_PDM_PCM_WSIZE_14_BIT) || \
                                                ((wordSize) == CY_PDM_PCM_WSIZE_16_BIT) || \
                                                ((wordSize) == CY_PDM_PCM_WSIZE_18_BIT) || \
                                                ((wordSize) == CY_PDM_PCM_WSIZE_20_BIT) || \
                                                ((wordSize) == CY_PDM_PCM_WSIZE_24_BIT) || \
                                                ((wordSize) == CY_PDM_PCM_WSIZE_32_BIT))

#define CY_PDM_PCM_IS_SCALE_VALID(scale)        ((scale) <= 31)

#define CY_PDM_PCM_IS_ENABLE_VALID(enable)         ((enable == 0)||(enable == 1))

#define CY_PDM_PCM_IS_SIGNEXTENSION_VALID(signExtension) ((signExtension == 0)||(signExtension == 1))

#define CY_PDM_PCM_IS_INTR_MASK_VALID(interrupt)  (0UL == ((interrupt) & ((uint32_t) ~CY_PDM_PCM_INTR_MASK)))
#define CY_PDM_PCM_IS_TRIG_LEVEL(trigLevel)     ((trigLevel) <= 63)

/** \endcond */

/**
* \addtogroup group_pdm_pcm_functions_v2
* \{
*/

cy_en_pdm_pcm_status_t Cy_PDM_PCM_Channel_Init(PDM_Type * base, cy_stc_pdm_pcm_channel_config_t const * channel_config, uint8_t channel_num);
void Cy_PDM_PCM_Channel_DeInit(PDM_Type * base, uint8_t channel_num);

cy_en_pdm_pcm_status_t   Cy_PDM_PCM_Init(PDM_Type * base, cy_stc_pdm_pcm_config_v2_t const * config);
                void     Cy_PDM_PCM_DeInit(PDM_Type * base);

